app/controllers/fullquestions_controller.rb

SELECT  "partsearchresults".* FROM "partsearchresults" WHERE "partsearchresults"."keyword" = ?  ORDER BY "partsearchresults"."id" ASC LIMIT 1  [["keyword", "eye"]]
SELECT COUNT(*) FROM "partsearchresults" WHERE "partsearchresults"."keyword" = ?  [["keyword", "ear"]]
SELECT  "datasets".* FROM "datasets" WHERE "datasets"."name" = ? LIMIT 1  [["name", "eye"]]
---
    def performsearch

        @dataset=Hash.new

        @poweradmin = current_user
        #This func do two things: get result back from API
        #+ save result to DB[partsearchresult]
        @attr_exper=params[:attr][:exper]
        @attr_tech = params[:attr][:tech]
        n_keyword = params[:search]

        if(@attr_exper!='All assays by Molecule')
            n_keyword=n_keyword+'+'+@attr_exper
        end

        if(@attr_tech!='All technologies')
            n_keyword=n_keyword+'+'+@attr_tech
        end

        if(n_keyword!='')
            #debugger
            #params[:search] =x
            #n_keyword = params[:search]
            @previous_record = Partsearchresult.where(:keyword => n_keyword)
            if @previous_record.count > 0
                @new_temp_record = @previous_record.first
                @all_dataset = @previous_record.first.Data_set_results
                @previous_dataset= Dataset.find_by_name(n_keyword).Data_set

INSERT INTO "datasets" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "eye"], ["created_at", "2017-03-29 18:44:00.420751"], ["updated_at", "2017-03-29 18:44:00.420751"]]
INSERT INTO "partsearchresults" ("keyword", "Data_set_results", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
            else
                @dataset_raw = search_from_arrayexpress(n_keyword)
                if(n_keyword != "")
                    @new_temp_record = Partsearchresult.create(keyword: n_keyword, Data_set_results: @dataset_raw)

SELECT  "partsearchresults".* FROM "partsearchresults" WHERE "partsearchresults"."id" = ? LIMIT 1  [["id", 1]]
---
                #Receive primary params
                @selected_accession_keys = params[:selected_keys]
                temp_record_id = params[:user][:temppsr_id]
                @temp_record = Partsearchresult.find(temp_record_id)

UPDATE "datasets" SET "Data_set" = ?, "updated_at" = ? WHERE "datasets"."id" = ?
SELECT  "datasets".* FROM "datasets" WHERE "datasets"."id" = ? LIMIT 1  [["id", 1]]
---
                            dataset.Data_set[k]=@temp_record.Data_set_results[k]
                        end
                    end
                    dataset.save!
                    redirect_to '/profile'
                    return
                end
                dataset=Dataset.find_by_id(temp_record_id.to_i)

SELECT "groups".* FROM "groups"
---
                @temp_record=@temp_record.id
            end
            #Display groups
            if !current_user.group_admin?      #main admin

SELECT "fullquestions".* FROM "fullquestions"
---
    def index
        #debugger
        @accession=params[:accession]
        @fullquestions=Array.new
        Fullquestion.all.each do |question|