app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "fullsubmissions".* FROM "fullsubmissions" WHERE "fullsubmissions"."user_id" = ?  [["user_id", 1]]
---
   def show
    if session[:user_id] == nil
      flash[:warning] = "please login"
      redirect_to '/login'
      return
    end
    @user = User.find(session[:user_id])
    @submissions=Array.new
    @user.fullsubmissions.each do |sub|

SELECT  "geosearchresults".* FROM "geosearchresults" WHERE (keyword='psoriasis')  ORDER BY "geosearchresults"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "geosearchresults" WHERE (keyword='tuberculosis' AND filter_f1='on' AND filter_f2='on' AND filter_f3='on' AND filter_f4='on' AND filter_f5='on'
---
    end

    if params[:searchSave_geo]!=''
      @previous_results_geo =  Geosearchresult.where("keyword=?",geo_keyword)

      if @previous_results_geo.count>0

INSERT INTO "geosearchresults" ("keyword", "created_at", "updated_at") VALUES (?, ?, ?)  [["keyword", "psoriasis"], ["created_at", "2017-05-01 03:36:57.244645"], ["updated_at", "2017-05-01 03:36:57.244645"]]
UPDATE "geosearchresults" SET "data_hash" = ?, "updated_at" = ? WHERE "geosearchresults"."id" = ?
---
          i=i+1
        end
        p @storage_geo
        Geosearchresult.where("keyword=?",geo_keyword).first_or_create(keyword: geo_keyword,data_hash: @storage_geo).update(data_hash: @storage_geo)

SELECT  "savesearchresults".* FROM "savesearchresults" WHERE (keyword='psoriasis' AND filter_exper='RNA assay' AND filter_tech='Sequencing assay')  ORDER BY "savesearchresults"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "savesearchresults" WHERE (keyword='psoriasis' AND filter_exper='' AND filter_tech='')
---
    elsif params[:searchSave]!=''

      #debugger
      @previous_results = Savesearchresult.where("keyword=? AND filter_exper=? AND filter_tech=?",n_keyword,@attr_exper,@attr_tech)
      #p @previous_results.count
      if @previous_results.count > 0

INSERT INTO "savesearchresults" ("keyword", "filter_exper", "filter_tech", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["keyword", "ear"], ["filter_exper", "RNA assay"], ["filter_tech", ""], ["created_at", "2017-05-01 02:32:52.435256"], ["updated_at", "2017-05-01 02:32:52.435256"]]
UPDATE "savesearchresults" SET "data_hash" = ?, "updated_at" = ? WHERE "savesearchresults"."id" = ?
---
          i=i+1
        end
        p @storage
        Savesearchresult.where("keyword=? AND filter_exper=? AND filter_tech=?",n_keyword,@attr_exper,@attr_tech).first_or_create(keyword: n_keyword,
        filter_exper: @attr_exper, filter_tech: @attr_tech, data_hash: @storage).update(data_hash: @storage)